//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Menu.h"
#include "About.h"
#include "UserInfo.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm1 *Form1;
//---------------------------------------------------------------------------
__fastcall TForm1::TForm1(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
void __fastcall TForm1::Button3Click(TObject *Sender)
{
    Close();
}
//---------------------------------------------------------------------------
void __fastcall TForm1::Button2Click(TObject *Sender)
{
	Form1->Hide();
	Form2->Show();
}
//---------------------------------------------------------------------------

void __fastcall TForm1::Button4Click(TObject *Sender)
{
	ShowMessage("Клавиатурный тренажёр — компьютерная программа, предназначенная для обучения набору на компьютерной клавиатуре.\nЦелями данного тренажёра являются:\n- Проверить скорость набора символов на клавиатуре\n- Научить слепому методу печати, в частности, задействовать для набора все десять пальцев рук\n- Увеличить скорость набора\n- Уменьшить количество опечаток\n- Улучшить ритмичность набора (что позволяет уменьшить усталость при наборе)\nМеню:\nНачать - начать тренироваку\nИнформация - информация о програмее\nРазработчик - информация о разработчике\nВыход - выход в Windows.");
}
//---------------------------------------------------------------------------

void __fastcall TForm1::Button1Click(TObject *Sender)
{
	Form1->Hide();
	Form3->Edit1->Clear();
	Form3->Show();
	Form3->Edit1->SetFocus();
}
//---------------------------------------------------------------------------

